package com.llc.astrologer.thet_yout

import android.os.Bundle
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import android.widget.AdapterView
import android.widget.ArrayAdapter
import androidx.fragment.app.Fragment
import androidx.fragment.app.viewModels
import androidx.navigation.fragment.findNavController
import com.llc.astrologer.R
import com.llc.astrologer.databinding.FragmentThetYoutBinding
import com.llc.astrologer.josarr.JosarrFragmentDirections
import com.llc.astrologer.josarr.JosarrViewModel


class ThetYoutFragment : Fragment(), AdapterView.OnItemSelectedListener {

    private val viewModel: ThetYoutViewModel by viewModels()

    private var _binding: FragmentThetYoutBinding? = null
    private val binding get() = _binding!!

    private lateinit var about: String

    var age = 0
    var spnDayPosition: Int = 0

    var agePlus: Int = 0

    var thetYout = mutableListOf<String>()

    override fun onCreateView(
        inflater: LayoutInflater, container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View {
        _binding = FragmentThetYoutBinding.inflate(inflater, container, false)
        return binding.root
    }

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)

        binding.spnDay.onItemSelectedListener = this
        ArrayAdapter.createFromResource(
            requireContext(),
            R.array.dayJosar,
            android.R.layout.simple_spinner_item
        ).also { adapter ->
            adapter.setDropDownViewResource(android.R.layout.simple_spinner_dropdown_item)
            binding.spnDay.adapter = adapter
        }

        thetYout.add(
            "သင်သည် ယခုနှစ်တွင် \"တနင်္ဂနွေဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "အရှေ့မြောက်အရပ်သို့ အသွားအလာ ရှောင်ရမည်။\n" +
                    "မရှောင်လျှင် ဘေးရန်ရောဂါရတတ်သည်။\n" +
                    "တနင်္ဂနွေနံကို လည်းရှောင်ပါ။\n" +
                    "လူလိမ်၊လူခိုး ခံရပြီး လူဆိုး၊သူခိုးများနှင့် ရန်ဖြစ်တတ်သည်။\n" +
                    "ကလေးသူငယ်များ ဖြစ်လျှင် နာသော်သေလုနီးပါး ဖြစ်ရတတ်သည်။\n" +
                    "သားသမီး၊ဆွေမျိုး၊ပေါင်းဖော်များကြောင့် စိတ်ဆင်းရဲ ကိုယ်ပန်းဖြစ်တတ်သည်။\n" +
                    "\n" +
                    "အိုးအိမ် မ,တည်ဘဲ နေအိမ်ပြောင်းရွှေ့ရတတ်သည်။\n" +
                    "သားမယားအတွက် စိတ်များရတတ်သည်။\n" +
                    "ကျွဲ၊နွား၊ခြေလေးချောင်း ထွက်တတ်သည်။\n" +
                    "ရုံးပြင်ကနားရောက်တတ်သည်။\n" +
                    "တစ်နှစ်အတွင်း အခြေမတည် နေရတတ်သည်။\n" +
                    "အနာအဆာလည်း ရတတ်သည်။\n" +
                    "၀◌မ်းရောဂါ၊လေရောဂါ စွဲကပ်တတ်သည်။ ရန်ရှိသည်။\n" +
                    "တောင်အရပ်က နံဖူးမောက်မောက်၊နှာယောင်ကောက်နှင့် \n" +
                    "လူ၀◌င်လျှင်လက်မခံနှင့်။ မိန်းမလည်းနှောက်ယှက်တတ်သည်။\n" +
                    "\n" +
                    "သက်ရောက်ဖြစ်သည့် အရှေ့အရပ်ကို ခရီး\u200Cေ၀◌းမသွားဘဲ ရှောင်သင့်၏။\n" +
                    "ခရီးသွားမိက အစွပ်အစွဲ အပြောအဆို ခံခဲ့ရတတ်သည်။\n" +
                    "ကိုယ့်အိမ်ပေါ်သို့ အမှုအခင်း သောက ရောက်လာတတ်သည်။\n" +
                    "တန်ခူး၊ကဆုန်၊ပြာသို သုံးလအတွင်း၌ အမှုအခင်း အရှုပ်အထွေး တွေ့ရတတ်သည်။\n" +
                    "ခိုးကိန်း၊မီးကိန်းနှင့် ကြုံဆုံရပြီး ချစ်သူခင်သူ အထင်လွဲခြင်း ခံရတတ်သည်။\n" +
                    "\n" +
                    "ဘုရားရှင်ထံ အာရုံပြုပြီးလျှင် ရေစင်ရေကောင်း၊ပန်း၊ဆီမီး၊အမွှေးအကြိုင်များကို\n" +
                    "အရှေ့မြောက်(တနင်္ဂနွေ)ထောင့်မှ လှူပါ။\n" +
                    "မကောင်းကျိုး ဟူသမျှ ပျောက်ကင်းပါလိမ့်မည်။"
        )
        thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"တနင်္လာဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "သမီးကညာ ခြေနှစ်ချောင်း၊ခြေလေးချောင်း၊မြင်း၊ကျွဲ၊နွား၊လူ၊အခြွေအရံများ၀◌င်လာအံ့။\n" +
                    "ရွှေ၊ငွေ၊ဥစ္စာ၊ဆန်စပါး၊အထည်အလိပ်၊အဖြူရောင်ရှိသည့်ငွေထည်ရတနာများရအံ့။\n" +
                    "မောင်ကောက်ရ သူဌေးအမွေ ရသောကိန်းကြုံသည်။\n" +
                    "မိဘအမွေ၊လယ်ယာမိုးမြေ၊ရွှေ၊ငွေ၊ရတနာ ရတတ်သည်။\n" +
                    "ကုန်ရောင်း၊ကုန်၀◌ယ် ပြုလုပ်လျှင် အမြတ်အစွန်းများရတတ်သည်။\n" +
                    "ဒါနကုသိုလ် လည်းပြုရတတ်သည်။\n" +
                    "\n" +
                    "ရန်ကို နိုင်၏။ အမှုအခင်းရှိလျှင် မိမိက နိုင်ကိန်းရှိသည်။ \n" +
                    "ကြံတိုင်းအောင်၊ ဆောင်တိုင်းမြောက်၏။\n" +
                    "အပျို၊လူပျို ဖြစ်လျှင် ချစ်သူ၊ရည်းစား တွေ့ရတတ်၏။\n" +
                    "အိမ်ထောင်သော်လည်းကောင်း ကျကိန်းရှိသည်။\n" +
                    "သွားလေရာ မျက်နှာပွင့်လန်း၏။\n" +
                    "အနောက်တောင်အရပ်က ကိုယ်၀◌န်ဆောင်မိန်းမ ၀◌င်လာတတ်၏။\n" +
                    "လက်မခံနှင့်။ \n" +
                    "\n" +
                    "တနင်္လာဂြိုဟ်၌ သက်ရောက်သူ၏ ဇာတာရှင်မှာ ကဆုန်၊၀◌ါခေါင်၊တန်ဆောင်မုန်း \n" +
                    "ဤသုံးလအတွင်း ရောက်သောအခါတိုင်း အရှေ့အရပ်နှင့် အနောက်အရပ်များမှ\n" +
                    "စုတ်ကောင်း လာဘ်ကောင်းများ ဧကန် ၀◌င်ရောက်လာရန်ရှိ၏။\n" +
                    "သူငယ်မကျန်းမာလျှင် လက်၀◌တ်တန်ဆာ ခမဲ ပေးကပျောက်၏။\n" +
                    "\n")
        )
        thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"အင်္ဂါဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "ဩဇာအာဏာပျက်စီးခြင်း၊ အလုပ်အကိုင်ဆုံးရှုံးခြင်း၊\n" +
                    "စိတ်ဆင်းရဲခြင်း၊ ကိုယ်ဆင်းရဲခြင်း၊ ဖျားနာခြင်း၊\n" +
                    "ဆီးရောဂါ၊ မျက်စိရောဂါများ ကပ်ငြိခြင်းဖြစ်တတ်သည်။\n" +
                    "အစပ်စာ ခိုက်သဖြင့် သတိပြု၍ ရှောင်ပါ။\n" +
                    "အမှုအခင်း ဖြစ်တတ်သည်။ခိုက်ရန်ဒေါသ ဖြစ်တတ်သည်။\n" +
                    "အရှေ့တောင်နှင့် အနောက်မြောက်မှ လူမိုက်လူတေများနှင့် စကားများရတတ်သည်။\n" +
                    "သူတစ်ပါး သား၊မယားနှင့် ပတ်သက်၍ စကားများရတတ်သည်။\n" +
                    "လူပို၊ လူလျှံ လက်မခံသင့်ချေ။\n" +
                    "\n" +
                    "စစ်တိုက်သွားသော် ရှုံးတတ်၏။\n" +
                    "အရောင်းအ၀◌ယ် လုပ်လျှင် ကုန်ရှုံး ကြွေးတင်တတ်၏။\n" +
                    "ရွှေ၊ငွေ၊ကျောက်သံပတ္တမြား ၀◌ယ်သော် အကောင်းမရဘဲ အလိမ်ခံရတတ်၏။\n" +
                    "လက်စွပ်၊ စိန်၊ နားဆွဲ၊ စောင် အင်္ဂါနံ ပစ္စည်းဥစ္စာများ ဧကန်ပျောက်ကိန်း ထွက်ကိန်းရှိသည်။\n" +
                    "အရှေ့တောင်ထောင့်က လူ၀◌င်၊လူထွက်များကို သတိပြု၍ ရှောင်ရမည်။\n" +
                    "၀◌င်လာလျှင် အိမ်တွင်းရေး ရှုပ်ထွေးကိန်း ရှိပေသည်။\n" +
                    "\n" +
                    "အင်္ဂါသက်ရောက်ခိုက်၌ ကဆုန်၊၀◌ါခေါင်၊တပေါင်းလများမှာ ခရီးသွားရှောင်ရမည်။\n" +
                    "မိန်းမမှု၊ ခိုးမှု၊ လင်ကွာ၊ မယားကွာ၊ ရည်းစားကွဲ ဖြစ်ပြီး ရန်ပွဲကြီးဖြစ်၍ ဓား၊ တုတ်ဒဏ်ရာရကိန်းရှိသည်။\n" +
                    "အချုပ်အနှောင် သွေးထွက်သံယို တွေ့ရတတ်သည်။\n" +
                    "ရုံးပြင်ကနားရောက်ရတတ်သည်။\n" +
                    "အတွင်းရန်မြင်သည်။\n" +
                    "အပြောအဆိုဆင်ခြင်ပါလေ။\n" +
                    "နေရာထိုင်ခင်း ရွှေ့ပြောင်းရတတ်သည်။\n" +
                    "\n" +
                    "ဗောဓိပင်ကို ဆွမ်း၊ ပန်း၊ ရေစင် ကပ်လှူရမည်။ \n" +
                    "အကုသိုလ်ဟူသမျှ အကုန်ပျောက်ကင်း၍ ဒါနအကျိုး ခံစားရမည်။")
        )
        thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"ဗုဒ္ဓဟူးဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "ဗုဒ္ဓဟူးနံ-လူ၊ ရွှေ၊ ငွေ၊ ဥစ္စာစီးပွား၊ အ၀◌တ်အစား၊ လှေ၊ လှည်း၊ လယ်ယာ၊ ဥယျာဥ◌် ၀◌င်ကိန်းရှိသည်။\n" +
                    "တောင်အရပ်က ရွှေ၊ ငွေ၊ အ၀◌တ်၊ လူကောင်း အပေါင်းအသင်းများ လာရောက်ကူညီမ,စအံ့။\n" +
                    "ရဟန်းတော်များ ဖြစ်လျှင် အလှူကြီး၊ ကျောင်းကြီး၊ ပစ္စည်းလေပါးများ၊ ဒါယိကာများ ရတတ်၏။\n" +
                    "အပျို၊ လူပျိုတို့သည် ချစ်သူရည်းစားများနှင့် တွေ့မည်။\n" +
                    "ကြင်ဖော်၊ ကြင်ဖက် ရကိန်းရှိသည်။\n" +
                    "လင်ကွဲ၊ မယားကွဲ၊ ရည်းစားကွဲလျှင် ပြန်ပေါင်းရတတ်သည်။\n" +
                    "စုတ် ခြေနှစ်ချောင်း ရကိန်းရှိသည်။\n" +
                    "စီးပွား လာဘ်လာဘ တိုးတက်ရာ၏။\n" +
                    "\n" +
                    "၀◌မ်းနာ၊ လေနာ ဖြစ်တတ်သည်။\n" +
                    "၀◌က်သား၊ ဖရဲ စသည်တို့ကိုရှောင်ပါ။\n" +
                    "အနောက်တောင်နှင့် အရှေ့မြောက်အရပ်က လူ၀◌င်လျှင် လက်မခံနှင့်။\n" +
                    "လိမ်လည် ခိုးယူတတ်သည်။\n" +
                    "တပို့တွဲ၊ ပြာသိုလ ဤနှစ်လအတွင်း အပြစ်တင်ခံရခြင်း၊\n" +
                    "မနာလို၀◌န်တိုခံရခြင်း စီးပွားရေးကြောင့်ဖြစ်ပေါ်လာတတ်၏။")
        )
        thetYout.add(
            ("\n" +
                    "သင်သည် ယခုနှစ်တွင် \"စနေဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "ရပ်\u200Cေ၀◌း ရပ်ခြား ခရီးသွားရတတ်သည်။\n" +
                    "ပစ္စည်းဥစ္စာ ပျက်စီးဆုံးရှုံးတတ်သည်။\n" +
                    "ခရီး\u200Cေ၀◌းကွာ မသွားအံ့၊ သွားမိသော် ဥပဒ်ဖြစ်တတ်သည်။\n" +
                    "အ၀◌တ်ကောင်း၊ အထည်ကောင်း ပျောက်ဆုံးခြင်း လူလိမ်ခံရခြင်းနှင့် ကြုံရတတ်၏။\n" +
                    "နီသောပစ္စည်းနှင့် နက်သောဥစ္စာ ၀◌င်လျှင်လက်မခံသင့်၊ ရန်နှင့်တွေ့မည်။\n" +
                    "ဘေးအန္တရာယ်များနှင့် တွေ့အံ့။\n" +
                    "\n" +
                    "မိန်းမနှင့် ပတ်သက်၍ စိတ်ညစ်ရတတ်သည်။\n" +
                    "အမှုအခင်းလည်း ဖြစ်ရတတ်သည်။\n" +
                    "ရုံးပြင်ကနားလည်း ရောက်တတ်သည်။\n" +
                    "အသွား အလာ ဆင်ခြင်ပါ။\n" +
                    "ခိုးကိန်း၊ မီးကိန်းနှင့် တွေ့ရတတ်သည်။\n" +
                    "သူတပါးအစွပ်အစွဲ၊ အနှောက်အယှက် ခံရတတ်သည်။\n" +
                    "အနောက်တောင်အရပ် ကိုရှောင်ပါ။\n" +
                    "\n" +
                    "အနောက်တောင်အရပ်နှင့် အရှေ့မြောက်အရပ်များသို့ ညအချိန်များ၌ အလည်မသွားကောင်း၊\n" +
                    "သွားလျှင် ရန်သူနှင့်တွေ့မည်။\n" +
                    "အဆိပ်ရှိသော သတ္တ၀◌ါများ ကိုက်၍ သွေးထွက်သံယို ဖြစ်တတ်သည်။\n" +
                    "စနေသက်ရောက်သောနှစ်တွင် ကဆုန်၊၀◌ါခေါင်လ ဤနှစ်လအတွင်းတွင် \n" +
                    "မိန်းမမှု၊ ရာဇ၀◌တ်မှု၊ ဖျားနာရေး၊ ခိုက်ရန်ဒေါသဖြစ်တတ်သည်။\n" +
                    "ခြေ၊ လက် ၌အနာ ရတတ်သည်။")
        )
        thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"ကြာသပတေးဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "ခရီးလမ်းများ တတ်သည်။\n" +
                    "သွားလေရာ စန်းပွင့်ပြီး ချစ်သူခင်သူ ပေါတတ်သည်။\n" +
                    "မိဘအမွေအနှစ် ရတတ်သည်။\n" +
                    "အရှေ့အရပ်နှင့် အနောက်အရပ်များမှ အမွေဟောင်း၊ အကြွေးဟောင်း၊ ရွှေ၊ ငွေဥစ္စာ၊ ရတနာများ၊\n" +
                    "စုတ်ကောင်း၊ လာဘ်ကောင်းများ ၀◌င်တတ်သည်။\n" +
                    "ဆန်စပါး၊ လယ်ယာ၊ ဥယျာဉ်ခြံမြေများ ရတတ်သည်။\n" +
                    "ဒါနလည်း ပြုရတတ်သည်။\n" +
                    "\n" +
                    "ကြာသပတေး သက်ရောက်၌ တပေါင်း၊ ကဆုန်လ ဤနှစ်လမှာ နေ့ရောညပါ \n" +
                    "စုတ်ကြီး၊ လာဘ်ကြီး၊ မိန်းမချော လှကညာများ ရကိန်းရှိသည်။\n" +
                    "အရှေ့တောင်အရပ်ကို အသွားအလာ ဆင်ခြင်ရမည်။\n" +
                    "၎င်းအရပ်က မိန်းမများနှင့် သတိထား၍ ဆက်ဆံရမည်။\n" +
                    "ရည်းစားဟောင်း၊ လင်ဟောင်း၊ မယားဟောင်း ရှိသည့် ယောက်ျားများ၊ မိန်းမများဖြစ်ပါက\n" +
                    "စိတ်နောက် ကိုယ်ပါ မလိုက်စားဘဲ စိတ်တည်တည် နေသင့်၏။\n" +
                    "\n" +
                    "ကြာသပတေးနေ့၌ အနောက်အရပ်မှ သပြေပန်းကို ညနေဘက်တွင် လှူပါ။\n" +
                    "နံနက်၌ ဆွမ်း၊ ရေစင်၊ ရေကောင်းပါ လှူပြီး လိုရာဆုကို တောင်းပါ။\n" +
                    "ကောင်းကျိုးစီးပွားများ ခံစားရအံ့။")
        )
        thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"ရာဟုဂြိုဟ်\" သက်ရောက်နေသဖြင့် \n" +
                    "လူကြီးမိဘ မုန်းထားတတ်သည်။\n" +
                    "ခိုက်ရန်ဒေါသ ဖြစ်တတ်သည်။\n" +
                    "အစွပ်အစွဲ ခံရတတ်သည်။\n" +
                    "ကိုယ်ပိုင် အိုးအိမ် ဥစ္စာ မီးလောင်ခြင်း၊ ခိုးယူခံရခြင်း၊ ပျောက်ရှခြင်း ဖြစ်တတ်သည်။\n" +
                    "နေရာထိုင်ခင်း ပြောင်းရွှေ့ရတတ်သည်။\n" +
                    "လူလိမ်သူခိုး မင်းစိုးရာဇာ နှောင့်ယှက်တတ်သည်။\n" +
                    "အသားထဲက လောက်ထွက်ဆိုသကဲ့သို့ ကိုယ့်ထဲက လူမကောင်းကြံတတ်သည်။\n" +
                    "\n" +
                    "အနောက်မြောက်အရပ်က လူများနှင့် တရားတပေါင် ဖြစ်ရတတ်သည်။\n" +
                    "လာဘ်၊ ရွှေ၊ ငွေဥစ္စာများ အ၀◌င်မရှိ၊ ခေါင်းပါးတတ်သည်။\n" +
                    "သေလုနီးပါး\u200Cရောဂါများ ဖြစ်တတ်သည်။\n" +
                    "အနောက်မြောက်အရပ်နှင့် အရှေ့တောင်အရပ်များသို့ \u200Cေ၀◌း\u200Cေ၀◌းခရီး မသွားကောင်း၊ ရှောင်ရမည်။\n" +
                    "သွားလျှင် ဘေးရန်တွေ့အံ့။ အဖျား၊ အနာကြီး ဖြစ်အံ့။\n" +
                    "\n" +
                    "ရာဟုဂြိုဟ်သည် အ၀◌င်ကအထွက်ရောက်အောင် မကောင်းကျိုးဟူသရွေ့ကို ပေးတတ်သဖြင့်\n" +
                    "တရားမှုခင်းများ၊ လင်ကွဲ၊ မယားကွဲ၊ ရည်းစားကွဲ၊ သားကွဲ၊ သမီးပျောက်၊ ဥစ္စာပျောက် \n" +
                    "ဘေးအမျိုးမျိုးနှင့် တွေ့ရအောင် ရာဟုဂြိုဟ်က မွှေတတ်၏။\n" +
                    "ဗုဒ္ဓဟူးနေ့ ညဘက်၌ အနောက်မြောက်ကနေ၍ စေတီဘုရား ဗောဓိညောင်ပင်တွင် \n" +
                    "ရေစင်ကောင်း၊ ယပ် ကိုယ်တိုင်လှူပြီး မကောင်းကျိုးမှန်သမျှ ပပျောက်ရန် ဆုတောင်းပါ။\n")
        )
        thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"သောကြာဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "ခရီးများများ သွားရကိန်းရှိသည်။\n" +
                    "ယောက်ျားဖြစ်လျှင် မယားကညာရတတ်သည်။\n" +
                    "မိန်းမဖြစ်လျှင် လင်ကောင်းရတတ်သည်။\n" +
                    "မြောက်အရပ်၊ တောင်အရပ်များမှ ဥယျာဉ်လယ်မြေ၊ ဆန်ရေစပါး၊ ယာဉ်ရထား၊ ကျွဲ၊ နွား၊ ဆင်၊ မြင်း၊ ဥစ္စာစီးပွား တိုးတက်အံ့။\n" +
                    "ဒါနပြုလျှင် ကောင်းသည်။\n" +
                    "အရောင်းအ၀◌ယ် အကြံအစည်  ဟူသမျှ အောင်မြင်ကြီးပွားမည်။\n" +
                    "အလုပ်ထူး အကိုင်ထူး ရမည်။\n" +
                    "သွေးလေ ဆီးချုပ်သောကြောင့် ဖျားနာတတ်သည်။\n" +
                    "\n" +
                    "သောကြာသက်ရောက်သောအခါ၌ တပေါင်းလ\u200C နွေရာသီအချိန်တွင် \n" +
                    "မြောက်အရပ်နှင့် တောင်အရပ်များမှ ပျိုကညာများနှင့် ရည်းစားဖြစ်ကိန်း မြင်သည်။\n" +
                    "ရဟန်းမြတ် ဖြစ်ပါလျှင် ကျောင်း၊ ပစ္စည်းလေးပါး ဒါယကာ၊ ဒါယိကာမများ အထောက်အပံ့ကောင်းများရအံ့။\n" +
                    "သောကြာနေ့ နံနက် မြောက်အရပ်ကနေပြီးလျှင် သစ်သီးဆွမ်း ကိုယ်တိုင်လှူပြီး လိုရာဆုတောင်းလေ။")
        )

        binding.btnThetYout.setOnClickListener {
            age = binding.etAge.text.toString().toInt()

            /* agePlus = 1
             while (agePlus < age) {
                 if (spnDayPosition in 0..6)
                     spnDayPosition++
                 else spnDayPosition = 0

                 agePlus++
             }*/

            about = viewModel.getThetYout(age, spnDayPosition)
            val action = ThetYoutFragmentDirections.actionThetYoutFragmentToShowFragment(about)
            findNavController().navigate(action)
        }

        binding.btnBack.setOnClickListener {
            findNavController().navigateUp()
        }
    }

    override fun onItemSelected(p0: AdapterView<*>?, p1: View?, position: Int, id: Long) {
        if (position in 0..8)
            spnDayPosition = position
    }

    override fun onNothingSelected(p0: AdapterView<*>?) {}
}