package com.llc.astrologer.thet_yout

import androidx.lifecycle.ViewModel

class ThetYoutViewModel : ViewModel() {

    var agePlus: Int = 1

    private var _spnDayPosition: Int = 0
    val spnDayPosition get() = _spnDayPosition

    private var _thetYout = mutableListOf<String>()
    val thetYout get() = _thetYout

    fun getThetYout(age: Int, position: Int): String {

        _spnDayPosition = position

        while (agePlus < age) {
            if (_spnDayPosition in 0..6)
                _spnDayPosition++
            else _spnDayPosition = 0

            agePlus++
        }

        addThetYout()
        return thetYout[spnDayPosition]
    }

    private fun addThetYout() {
        _thetYout.add(
            "သင်သည် ယခုနှစ်တွင် \"တနင်္ဂနွေဂြိုဟ်\" သက်ရောက်နေသဖြင့် အရှေ့မြောက်အရပ်သို့ အသွားအလာ ရှောင်ရမည်။\n" + "\n" +
                    "မရှောင်လျှင် ဘေးရန်ရောဂါရတတ်သည်။\n" + "\n" +
                    "တနင်္ဂနွေနံကို လည်းရှောင်ပါ။\n" + "\n" +
                    "လူလိမ်၊ လူခိုး ခံရပြီး လူဆိုး၊ သူခိုးများနှင့် ရန်ဖြစ်တတ်သည်။\n" + "\n" +
                    "ကလေးသူငယ်များ ဖြစ်လျှင် နာသော် သေလုနီးပါး ဖြစ်ရတတ်သည်။\n" + "\n" +
                    "သားသမီး၊ ဆွေမျိုး၊ ပေါင်းဖော်များကြောင့် စိတ်ဆင်းရဲ ကိုယ်ပန်းဖြစ်တတ်သည်။\n" + "\n" +
                    "အိုးအိမ် မ,တည်ဘဲ နေအိမ် ပြောင်းရွှေ့ရတတ်သည်။\n" + "\n" +
                    "သားမယားအတွက် စိတ်များရတတ်သည်။\n" + "\n" +
                    "ကျွဲ၊ နွား၊ ခြေလေးချောင်း ထွက်တတ်သည်။\n" + "\n" +
                    "ရုံးပြင်ကနားရောက်တတ်သည်။\n" + "\n" +
                    "တစ်နှစ်အတွင်း အခြေမတည် နေရတတ်သည်။\n" + "\n" +
                    "အနာအဆာလည်း ရတတ်သည်။\n" + "\n" +
                    "၀◌မ်းရောဂါ၊ လေရောဂါ စွဲကပ်တတ်သည်။\n" + "\n" +
                    "ရန်ရှိသည်။\n" + "\n" +
                    "တောင်အရပ်က နံဖူးမောက်မောက်၊ နှာယောင်ကောက်နှင့် လူ၀◌င်လျှင် လက်မခံနှင့်။ \n" + "\n" +
                    " မိန်းမလည်း နှောက်ယှက်တတ်သည်။\n" + "\n" +
                    "သက်ရောက်ဖြစ်သည့် အရှေ့အရပ်ကို ခရီး\u200Cေ၀◌း မသွားဘဲ ရှောင်သင့်၏။\n" + "\n" +
                    "ခရီးသွားမိက အစွပ်အစွဲ အပြောအဆို ခံခဲ့ရတတ်သည်။\n" + "\n" +
                    "ကိုယ့်အိမ်ပေါ်သို့ အမှုအခင်း သောက ရောက်လာတတ်သည်။\n" + "\n" +
                    "တန်ခူး၊ ကဆုန်၊ ပြာသို သုံးလအတွင်း၌ အမှုအခင်း အရှုပ်အထွေး တွေ့ရတတ်သည်။\n" + "\n" +
                    "ခိုးကိန်း၊ မီးကိန်းနှင့် ကြုံဆုံရပြီး ချစ်သူခင်သူ အထင်လွဲခြင်း ခံရတတ်သည်။\n" + "\n" +
                    "ဘုရားရှင်ထံ အာရုံပြုပြီးလျှင် ရေစင်ရေကောင်း၊ ပန်း၊ ဆီမီး၊ အမွှေးအကြိုင်များကို အရှေ့မြောက်(တနင်္ဂနွေ)ထောင့်မှ လှူပါ။\n" + "\n" +
                    "မကောင်းကျိုး ဟူသမျှ ပျောက်ကင်းပါလိမ့်မည်။"
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"တနင်္လာဂြိုဟ်\" သက်ရောက်နေသဖြင့် သမီးကညာ ခြေနှစ်ချောင်း၊ ခြေလေးချောင်း၊ မြင်း၊ ကျွဲ၊ နွား၊ လူ၊ အခြွေအရံများ ၀◌င်လာအံ့။\n" + "\n" +
                    "ရွှေ၊ ငွေ၊ ဥစ္စာ၊ ဆန်စပါး၊ အထည်အလိပ်၊ အဖြူရောင်ရှိသည့် ငွေထည်ရတနာများ ရအံ့။\n" + "\n" +
                    "မောင်ကောက်ရ သူဌေးအမွေ ရသောကိန်း ကြုံသည်။\n" + "\n" +
                    "မိဘအမွေ၊ လယ်ယာမိုးမြေ၊ ရွှေ၊ ငွေ၊ ရတနာ ရတတ်သည်။\n" + "\n" +
                    "ကုန်ရောင်း၊ ကုန်၀◌ယ် ပြုလုပ်လျှင် အမြတ်အစွန်းများ ရတတ်သည်။\n" + "\n" +
                    "ဒါနကုသိုလ်လည်း ပြုရတတ်သည်။\n" + "\n" +
                    "ရန်ကို နိုင်၏။ \n" + "\n" +
                    "အမှုအခင်းရှိလျှင် မိမိက နိုင်ကိန်းရှိသည်။ \n" + "\n" +
                    "ကြံတိုင်းအောင်၊ ဆောင်တိုင်းမြောက်၏။\n" + "\n" +
                    "အပျို၊ လူပျို ဖြစ်လျှင် ချစ်သူ၊ ရည်းစား တွေ့ရတတ်၏။\n" + "\n" +
                    "အိမ်ထောင်သော်လည်းကောင်း ကျကိန်းရှိသည်။\n" + "\n" +
                    "သွားလေရာ မျက်နှာ ပွင့်လန်း၏။\n" + "\n" +
                    "အနောက်တောင်အရပ်က ကိုယ်၀◌န်ဆောင်မိန်းမ ၀◌င်လာတတ်၏။ လက်မခံနှင့်။ \n" + "\n" +
                    "တနင်္လာဂြိုဟ်၌ သက်ရောက်သူ၏ ဇာတာရှင်မှာ ကဆုန်၊ ၀◌ါခေါင်၊ တန်ဆောင်မုန်း " +
                    "ဤသုံးလအတွင်း ရောက်သောအခါတိုင်း အရှေ့အရပ်နှင့် အနောက်အရပ်များမှ" +
                    "စုတ်ကောင်း လာဘ်ကောင်းများ ဧကန် ၀◌င်ရောက်လာရန်ရှိ၏။\n" + "\n" +
                    "သူငယ်မကျန်းမာလျှင် လက်၀◌တ်တန်ဆာ ခမဲ ပေးက ပျောက်၏။")
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"အင်္ဂါဂြိုဟ်\" သက်ရောက်နေသဖြင့် ဩဇာအာဏာပျက်စီးခြင်း၊ အလုပ်အကိုင်ဆုံးရှုံးခြင်း၊ စိတ်ဆင်းရဲခြင်း၊ ကိုယ်ဆင်းရဲခြင်း၊ " +
                    "ဖျားနာခြင်း၊ ဆီးရောဂါ၊ မျက်စိရောဂါများ ကပ်ငြိခြင်း ဖြစ်တတ်သည်။\n" + "\n" +
                    "အစပ်စာ ခိုက်သဖြင့် သတိပြု၍ ရှောင်ပါ။\n" + "\n" +
                    "အမှုအခင်း ဖြစ်တတ်သည်။\n" + "\n" +
                    "ခိုက်ရန်ဒေါသ ဖြစ်တတ်သည်။\n" + "\n" +
                    "အရှေ့တောင်နှင့် အနောက်မြောက်မှ လူမိုက် လူတေများနှင့် စကားများရတတ်သည်။\n" + "\n" +
                    "သူတစ်ပါး သား၊ မယားနှင့် ပတ်သက်၍ စကားများရတတ်သည်။\n" + "\n" +
                    "လူပို၊ လူလျှံ လက်မခံသင့်ချေ။\n" + "\n" +
                    "စစ်တိုက်သွားသော် ရှုံးတတ်၏။\n" + "\n" +
                    "အရောင်းအ၀◌ယ် လုပ်လျှင် ကုန်ရှုံး ကြွေးတင်တတ်၏။\n" + "\n" +
                    "ရွှေ၊ ငွေ၊ ကျောက်သံပတ္တမြား ၀◌ယ်သော် အကောင်းမရဘဲ အလိမ်ခံရတတ်၏။\n" + "\n" +
                    "လက်စွပ်၊ စိန်၊ နားဆွဲ၊ စောင် အင်္ဂါနံ ပစ္စည်းဥစ္စာများ ဧကန်ပျောက်ကိန်း ထွက်ကိန်းရှိသည်။\n" + "\n" +
                    "အရှေ့တောင်ထောင့်က လူ၀◌င်၊ လူထွက်များကို သတိပြု၍ ရှောင်ရမည်။\n" +
                    "၀◌င်လာလျှင် အိမ်တွင်းရေး ရှုပ်ထွေးကိန်း ရှိပေသည်။\n" + "\n" +
                    "အင်္ဂါသက်ရောက်ခိုက်၌ ကဆုန်၊ ၀◌ါခေါင်၊ တပေါင်းလများမှာ ခရီးသွားရှောင်ရမည်။\n" + "\n" +
                    "မိန်းမမှု၊ ခိုးမှု၊ လင်ကွာ၊ မယားကွာ၊ ရည်းစားကွဲ ဖြစ်ပြီး ရန်ပွဲကြီးဖြစ်၍ ဓား၊ တုတ်ဒဏ်ရာရကိန်းရှိသည်။\n" + "\n" +
                    "အချုပ်အနှောင် သွေးထွက်သံယို တွေ့ရတတ်သည်။\n" + "\n" +
                    "ရုံးပြင်ကနား ရောက်ရတတ်သည်။\n" + "\n" +
                    "အတွင်းရန် မြင်သည်။\n" + "\n" +
                    "အပြောအဆို ဆင်ခြင်ပါလေ။\n" + "\n" +
                    "နေရာထိုင်ခင်း ရွှေ့ပြောင်းရတတ်သည်။\n" + "\n" +
                    "ဗောဓိပင်ကို ဆွမ်း၊ ပန်း၊ ရေစင် ကပ်လှူရမည်။ \n" + "\n" +
                    "အကုသိုလ်ဟူသမျှ အကုန်ပျောက်ကင်း၍ ဒါနအကျိုး ခံစားရမည်။")
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"ဗုဒ္ဓဟူးဂြိုဟ်\" သက်ရောက်နေသဖြင့်\n" +
                    "ဗုဒ္ဓဟူးနံ- လူ၊ ရွှေ၊ ငွေ၊ ဥစ္စာစီးပွား၊ အ၀◌တ်အစား၊ လှေ၊ လှည်း၊ လယ်ယာ၊ ဥယျာဥ◌် ၀◌င်ကိန်းရှိသည်။\n" + "\n" +
                    "တောင်အရပ်က ရွှေ၊ ငွေ၊ အ၀◌တ်၊ လူကောင်း အပေါင်းအသင်းများ လာရောက်ကူညီမ,စအံ့။\n" + "\n" +
                    "ရဟန်းတော်များ ဖြစ်လျှင် အလှူကြီး၊ ကျောင်းကြီး၊ ပစ္စည်းလေပါးများ၊ ဒါယိကာများ ရတတ်၏။\n" + "\n" +
                    "အပျို၊ လူပျိုတို့သည် ချစ်သူရည်းစားများနှင့် တွေ့မည်။\n" + "\n" +
                    "ကြင်ဖော်၊ ကြင်ဖက် ရကိန်းရှိသည်။\n" + "\n" +
                    "လင်ကွဲ၊ မယားကွဲ၊ ရည်းစားကွဲလျှင် ပြန်ပေါင်းရတတ်သည်။\n" + "\n" +
                    "စုတ် ခြေနှစ်ချောင်း ရကိန်းရှိသည်။\n" + "\n" +
                    "စီးပွား လာဘ်လာဘ တိုးတက်ရာ၏။\n" + "\n" +
                    "၀◌မ်းနာ၊ လေနာ ဖြစ်တတ်သည်။\n" + "၀◌က်သား၊ ဖရဲ စသည်တို့ကိုရှောင်ပါ။\n" + "\n" +
                    "အနောက်တောင်နှင့် အရှေ့မြောက်အရပ်က လူ၀◌င်လျှင် လက်မခံနှင့်။\n" + "လိမ်လည် ခိုးယူတတ်သည်။\n" + "\n" +
                    "တပို့တွဲ၊ ပြာသိုလ ဤနှစ်လအတွင်း အပြစ်တင်ခံရခြင်း၊ မနာလို၀◌န်တိုခံရခြင်း စီးပွားရေးကြောင့် ဖြစ်ပေါ်လာတတ်၏။")
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"စနေဂြိုဟ်\" သက်ရောက်နေသဖြင့် ရပ်\u200Cေ၀◌း ရပ်ခြား ခရီးသွားရတတ်သည်။\n" + "\n" +
                    "ပစ္စည်းဥစ္စာ ပျက်စီး ဆုံးရှုံးတတ်သည်။\n" + "\n" +
                    "ခရီး\u200Cေ၀◌းကွာ မသွားအံ့။\n" + "သွားမိသော် ဥပဒ် ဖြစ်တတ်သည်။\n" + "\n" +
                    "အ၀◌တ်ကောင်း၊ အထည်ကောင်း ပျောက်ဆုံးခြင်း လူလိမ်ခံရခြင်းနှင့် ကြုံရတတ်၏။\n" + "\n" +
                    "နီသောပစ္စည်းနှင့် နက်သောဥစ္စာ ၀◌င်လျှင် လက်မခံသင့်။\n" + "ရန်နှင့်တွေ့မည်။\n" + "\n" +
                    "ဘေးအန္တရာယ်များနှင့် တွေ့အံ့။\n" + "\n" +
                    "မိန်းမနှင့် ပတ်သက်၍ စိတ်ညစ်ရတတ်သည်။\n" + "\n" +
                    "အမှုအခင်းလည်း ဖြစ်ရတတ်သည်။\n" + "\n" +
                    "ရုံးပြင်ကနားလည်း ရောက်တတ်သည်။\n" + "\n" +
                    "အသွား အလာ ဆင်ခြင်ပါ။\n" + "\n" +
                    "ခိုးကိန်း၊ မီးကိန်းနှင့် တွေ့ရတတ်သည်။\n" + "\n" +
                    "သူတပါးအစွပ်အစွဲ၊ အနှောက်အယှက် ခံရတတ်သည်။\n" + "\n" +
                    "အနောက်တောင်အရပ် ကိုရှောင်ပါ။\n" + "\n" +
                    "အနောက်တောင်အရပ်နှင့် အရှေ့မြောက်အရပ်များသို့ ညအချိန်များ၌ အလည်မသွားကောင်း။\n" + "သွားလျှင် ရန်သူနှင့်တွေ့မည်။\n" + "\n" +
                    "အဆိပ်ရှိသော သတ္တ၀◌ါများ ကိုက်၍ သွေးထွက်သံယို ဖြစ်တတ်သည်။\n" + "\n" +
                    "စနေ သက်ရောက်သောနှစ်တွင် ကဆုန်၊ ၀◌ါခေါင်လ ဤနှစ်လအတွင်းတွင် မိန်းမမှု၊ ရာဇ၀◌တ်မှု၊ ဖျားနာရေး၊ ခိုက်ရန်ဒေါသ ဖြစ်တတ်သည်။\n" + "\n" +
                    "ခြေ၊ လက်၌ အနာ ရတတ်သည်။")
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"ကြာသပတေးဂြိုဟ်\" သက်ရောက်နေသဖြင့် ခရီးလမ်းများ တတ်သည်။\n" + "\n" +
                    "သွားလေရာ စန်းပွင့်ပြီး ချစ်သူခင်သူ ပေါတတ်သည်။\n" + "\n" +
                    "မိဘ အမွေအနှစ် ရတတ်သည်။\n" + "\n" +
                    "အရှေ့အရပ်နှင့် အနောက်အရပ်များမှ အမွေဟောင်း၊ အကြွေးဟောင်း၊ ရွှေ၊ ငွေဥစ္စာ၊ ရတနာများ၊ စုတ်ကောင်း၊ လာဘ်ကောင်းများ ၀◌င်တတ်သည်။\n" + "\n" +
                    "ဆန်စပါး၊ လယ်ယာ၊ ဥယျာဉ်ခြံမြေများ ရတတ်သည်။\n" + "\n" +
                    "ဒါနလည်း ပြုရတတ်သည်။\n" + "\n" +
                    "ကြာသပတေးသက်ရောက်၌ တပေါင်း၊ ကဆုန်လ ဤနှစ်လမှာ နေ့ရောညပါ စုတ်ကြီး၊ လာဘ်ကြီး၊ မိန်းမချော လှကညာများ ရကိန်းရှိသည်။\n" + "\n" +
                    "အရှေ့တောင်အရပ်ကို အသွားအလာ ဆင်ခြင်ရမည်။\n" + "၎င်းအရပ်က မိန်းမများနှင့် သတိထား၍ ဆက်ဆံရမည်။\n" + "\n" +
                    "ရည်းစားဟောင်း၊ လင်ဟောင်း၊ မယားဟောင်း ရှိသည့် ယောက်ျားများ၊ မိန်းမများဖြစ်ပါက စိတ်နောက် ကိုယ်ပါ မလိုက်စားဘဲ စိတ်တည်တည် နေသင့်၏။\n" + "\n" +
                    "ကြာသပတေးနေ့၌ အနောက်အရပ်မှ သပြေပန်းကို ညနေဘက်တွင် လှူပါ။\n" + "\n" +
                    "နံနက်၌ ဆွမ်း၊ ရေစင်၊ ရေကောင်းပါ လှူပြီး လိုရာဆုကို တောင်းပါ။\n" + "\n" +
                    "ကောင်းကျိုးစီးပွားများ ခံစားရအံ့။")
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"ရာဟုဂြိုဟ်\" သက်ရောက်နေသဖြင့် လူကြီးမိဘ မုန်းထားတတ်သည်။\n" + "\n" +
                    "ခိုက်ရန်ဒေါသ ဖြစ်တတ်သည်။\n" + "\n" +
                    "အစွပ်အစွဲ ခံရတတ်သည်။\n" + "\n" +
                    "ကိုယ်ပိုင် အိုးအိမ် ဥစ္စာ မီးလောင်ခြင်း၊ ခိုးယူခံရခြင်း၊ ပျောက်ရှခြင်း ဖြစ်တတ်သည်။\n" + "\n" +
                    "နေရာထိုင်ခင်း ပြောင်းရွှေ့ရတတ်သည်။\n" + "\n" +
                    "လူလိမ်သူခိုး မင်းစိုးရာဇာ နှောင့်ယှက်တတ်သည်။\n" + "\n" +
                    "အသားထဲက လောက်ထွက်ဆိုသကဲ့သို့ ကိုယ့်ထဲက လူမကောင်းကြံတတ်သည်။\n" + "\n" +
                    "အနောက်မြောက်အရပ်က လူများနှင့် တရားတပေါင် ဖြစ်ရတတ်သည်။\n" + "\n" +
                    "လာဘ်၊ ရွှေ၊ ငွေဥစ္စာများ အ၀◌င်မရှိ၊ ခေါင်းပါးတတ်သည်။\n" + "\n" +
                    "သေလုနီးပါး ရောဂါများ ဖြစ်တတ်သည်။\n" + "\n" +
                    "အနောက်မြောက်အရပ်နှင့် အရှေ့တောင်အရပ်များသို့ \u200Cေ၀◌း\u200Cေ၀◌းခရီး မသွားကောင်း၊ ရှောင်ရမည်။\n" +
                    "သွားလျှင် ဘေးရန်တွေ့အံ့။ အဖျား၊ အနာကြီး ဖြစ်အံ့။\n" + "\n" +
                    "ရာဟုဂြိုဟ်သည် အ၀◌င်က အထွက်ရောက်အောင် မကောင်းကျိုးဟူသရွေ့ကို ပေးတတ်သဖြင့် တရားမှုခင်းများ၊ လင်ကွဲ၊ မယားကွဲ၊ ရည်းစားကွဲ၊" +
                    " သားကွဲ၊ သမီးပျောက်၊ ဥစ္စာပျောက် ဘေးအမျိုးမျိုးနှင့် တွေ့ရအောင် ရာဟုဂြိုဟ်က မွှေတတ်၏။\n" + "\n" +
                    "ဗုဒ္ဓဟူးနေ့ ညဘက်၌ အနောက်မြောက်ကနေ၍ စေတီဘုရား ဗောဓိညောင်ပင်တွင် ရေစင်ကောင်း၊ ယပ် ကိုယ်တိုင်လှူပြီး မကောင်းကျိုးမှန်သမျှ ပပျောက်ရန် ဆုတောင်းပါ။")
        )
        _thetYout.add(
            ("သင်သည် ယခုနှစ်တွင် \"သောကြာဂြိုဟ်\" သက်ရောက်နေသဖြင့် ခရီးများများ သွားရကိန်းရှိသည်။\n" + "\n" +
                    "ယောက်ျားဖြစ်လျှင် မယားကညာရတတ်သည်။\n" + "\n" +
                    "မိန်းမဖြစ်လျှင် လင်ကောင်းရတတ်သည်။\n" + "\n" +
                    "မြောက်အရပ်၊ တောင်အရပ်များမှ ဥယျာဉ်လယ်မြေ၊ ဆန်ရေစပါး၊ ယာဉ်ရထား၊ ကျွဲ၊ နွား၊ ဆင်၊ မြင်း၊ ဥစ္စာစီးပွား တိုးတက်အံ့။\n" + "\n" +
                    "ဒါနပြုလျှင် ကောင်းသည်။\n" + "\n" +
                    "အရောင်းအ၀◌ယ် အကြံအစည်  ဟူသမျှ အောင်မြင် ကြီးပွားမည်။\n" + "\n" +
                    "အလုပ်ထူး အကိုင်ထူး ရမည်။\n" + "\n" +
                    "သွေးလေ ဆီးချုပ်သောကြောင့် ဖျားနာတတ်သည်။\n" + "\n" +
                    "သောကြာသက်ရောက်သောအခါ၌ တပေါင်းလ နွေရာသီအချိန်တွင် မြောက်အရပ်နှင့် တောင်အရပ်များမှ ပျိုကညာများနှင့် ရည်းစားဖြစ်ကိန်း မြင်သည်။\n" + "\n" +
                    "ရဟန်းမြတ် ဖြစ်ပါလျှင် ကျောင်း၊ ပစ္စည်းလေးပါး ဒါယကာ၊ ဒါယိကာမများ အထောက်အပံ့ကောင်းများရအံ့။\n" + "\n" +
                    "သောကြာနေ့ နံနက် မြောက်အရပ်ကနေပြီးလျှင် သစ်သီးဆွမ်း ကိုယ်တိုင်လှူပြီး လိုရာဆုတောင်းလေ။")
        )
    }

    override fun onCleared() {
        super.onCleared()

        agePlus = 0
        _spnDayPosition = 0
    }
}